prestonericson7-lang/Pred_Ai/esp32_surveillance_detector/surveillance_detector.ino
const int OUI_COUNT = sizeof(OUI_TABLE)/sizeof(OUI_TABLE[0]);

// SSID substrings that strongly suggest a camera/NVR (lowercased compare).
const char* SSID_KEYWORDS[] = {
  "ipcam","ipc-","ipc_","hikvision","hik-","dahua","reolink","wyze","tapo","ezviz",
  "foscam","amcrest","arlo","lorex","swann","annke","vivotek","unifi","instar",
  "camera","doorbell","babymonitor","nvr-","dvr-","yicam","goprocam"
};
const int SSID_KW_COUNT = sizeof(SSID_KEYWORDS)/sizeof(SSID_KEYWORDS[0]);

// BLE advertised-name substrings that suggest a tracker/camera.
const char* BLE_KEYWORDS[] = {
  "airtag","tile","smarttag","chipolo","trackr","itag","find my","gps tracker",
  "wyze","reolink","ring","nest cam","camera"
};
const int BLE_KW_COUNT = sizeof(BLE_KEYWORDS)/sizeof(BLE_KEYWORDS[0]);

// ---------------- tracking table ----------------
struct Sighting {
  uint8_t  mac[6];
  bool     isBle;
  int8_t   firstRssi;
  int8_t   bestRssi;
  float    emaRssi;       // smoothed signal
  uint16_t hits;
  uint16_t cycles;        // distinct scan cycles seen in
  uint16_t lastCycle;
  uint32_t firstSeenMs;
  uint32_t lastSeenMs;
  double   firstLat, firstLon, lastLat, lastLon;
  bool     mobileFlag;    // GPS: moved with you
  bool     approachFlag;  // signal rose over time
  bool     vendorFlag;    // matched vendor/keyword (shown)
  bool     alertWorthy;   // camera-grade vendor or following (alerts)
  bool     alerted;
  char     label[24];
};
Sighting devices[MAX_DEVICES];
int deviceCount = 0;

// ---------------- helpers ----------------
double haversineMeters(double a1,double o1,double a2,double o2){
  const double R=6371000.0; double dA=radians(a2-a1), dO=radians(o2-o1);
  double a=sin(dA/2)*sin(dA/2)+cos(radians(a1))*cos(radians(a2))*sin(dO/2)*sin(dO/2);
  return R*2*atan2(sqrt(a),sqrt(1-a));
}
String macToStr(const uint8_t* m){char b[18];sprintf(b,"%02X:%02X:%02X:%02X:%02X:%02X",m[0],m[1],m[2],m[3],m[4],m[5]);return String(b);}
String getTimestamp(){
  if(gps.date.isValid()&&gps.time.isValid()){char b[32];
    sprintf(b,"%04d-%02d-%02dT%02d:%02d:%02dZ",gps.date.year(),gps.date.month(),gps.date.day(),gps.time.hour(),gps.time.minute(),gps.time.second());
    return String(b);}
  return String(millis()/1000)+"s";
}
bool isRandomMac(const uint8_t* m){return (m[0]&0x02)!=0;}
int lookupOui(const uint8_t* m){
  if(isRandomMac(m))return -1;
  for(int i=0;i<OUI_COUNT;i++)
    if(m[0]==OUI_TABLE[i].oui[0]&&m[1]==OUI_TABLE[i].oui[1]&&m[2]==OUI_TABLE[i].oui[2])return i;
  return -1;
}
// returns matched keyword index or -1 (haystack must be lowercase)
int matchKeyword(const String& hay,const char** table,int count){
  for(int i=0;i<count;i++) if(hay.indexOf(table[i])>=0) return i;
  return -1;
}

// ---------------- XOR crypto + history (kept) ----------------
String encryptCommand(String cmd){String e=cmd;for(unsigned i=0;i<e.length();i++)e[i]=e[i]^KEY;return e;}
String decryptCommand(String e){String d=e;for(unsigned i=0;i<d.length();i++)d[i]=d[i]^KEY;return d;}
bool isRepeatCommand(String c){for(int i=0;i<10;i++)if(commandHistory[i]==c)return true;return false;}
void addToHistory(String c){commandHistory[historyIndex]=c;historyIndex=(historyIndex+1)%10;}

// ---------------- scramble + status log (kept) ----------------
void scrambleGPS(){
  if(gps.location.isValid()){
    double nLat=(random(-150,150)/100000.0)*1.5;
    double nLon=(random(-150,150)/100000.0)*1.5;
    reportedLat=realLat+nLat; reportedLon=realLon+nLon;
  }
}
void logStatusToSD(){
  scrambleGPS();
  if(!sdReady)return;
  logFile=SD.open("/guardian.log",FILE_APPEND);
  if(logFile){
    logFile.printf("[%s] Scan:%s Alerts:%s Devices:%d Real:%.6f,%.6f Reported:%.6f,%.6f\n",
      getTimestamp().c_str(),scanningEnabled?"YES":"NO",alertsEnabled?"YES":"NO",deviceCount,
      realLat,realLon,reportedLat,reportedLon);
    logFile.close();
  }
}

// ---------------- persistence ----------------
void saveTable(){
  if(!sdReady)return;
  File f=SD.open(DB_PATH,FILE_WRITE); if(!f)return;
  uint32_t magic=DB_MAGIC; f.write((const uint8_t*)&magic,sizeof(magic));
  f.write((const uint8_t*)&deviceCount,sizeof(deviceCount));
  if(deviceCount>0) f.write((const uint8_t*)devices,sizeof(Sighting)*deviceCount);
  f.close();
}
void loadTable(){
  if(!sdReady||!SD.exists(DB_PATH))return;
  File f=SD.open(DB_PATH,FILE_READ); if(!f)return;
  uint32_t magic=0; int count=0;
  if(f.read((uint8_t*)&magic,sizeof(magic))==sizeof(magic)&&magic==DB_MAGIC&&
     f.read((uint8_t*)&count,sizeof(count))==sizeof(count)&&count>=0&&count<=MAX_DEVICES){
    if(f.read((uint8_t*)devices,sizeof(Sighting)*count)==(int)(sizeof(Sighting)*count))deviceCount=count;
  } else Serial.println("Old/incompatible device DB ignored.");
  f.close();
  Serial.printf("Loaded %d remembered devices.\n",deviceCount);
}

// ---------------- audio (ES8311 codec + I2S tones) ----------------
#if ENABLE_AUDIO
void es8311W(uint8_t r,uint8_t v){Wire.beginTransmission(ES8311_ADDR);Wire.write(r);Wire.write(v);Wire.endTransmission();}
bool es8311Probe(){Wire.beginTransmission(ES8311_ADDR);return Wire.endTransmission()==0;}

void audioInit(){
  pinMode(PA_EN_PIN,OUTPUT); digitalWrite(PA_EN_PIN,LOW);   // amp off until ready
  Wire.begin(CODEC_SDA_PIN,CODEC_SCL_PIN,100000);
  if(!es8311Probe()){
    Serial.println("[AUDIO] ES8311 not found at 0x18 (check I2C) — audio off");
    audioReady=false; return;
  }
  // minimal ES8311 playback init (MCLK provided by I2S on pin 38)
  es8311W(0x00,0x1F); delay(20); es8311W(0x00,0x00); delay(10);
  es8311W(0x01,0x30); es8311W(0x02,0x10); es8311W(0x03,0x10); es8311W(0x16,0x24);
  es8311W(0x04,0x10); es8311W(0x05,0x00); es8311W(0x0B,0x00); es8311W(0x0C,0x00);
  es8311W(0x10,0x1F); es8311W(0x11,0x7F); es8311W(0x00,0x80);
  es8311W(0x0D,0x01); es8311W(0x0E,0x02); es8311W(0x12,0x00); es8311W(0x13,0x10);
  es8311W(0x32,0xBF); es8311W(0x37,0x08); es8311W(0x44,0x08); es8311W(0x45,0x00);

  i2s_chan_config_t cc = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_0, I2S_ROLE_MASTER);
  if(i2s_new_channel(&cc,&i2sTx,NULL)!=ESP_OK){audioReady=false;return;}
  i2s_std_config_t sc = {
    .clk_cfg  = I2S_STD_CLK_DEFAULT_CONFIG(AUDIO_RATE),
    .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO),
    .gpio_cfg = { .mclk=(gpio_num_t)I2S_MCLK_PIN, .bclk=(gpio_num_t)I2S_BCLK_PIN,
                  .ws=(gpio_num_t)I2S_WS_PIN, .dout=(gpio_num_t)I2S_DOUT_PIN,
                  .din=I2S_GPIO_UNUSED, .invert_flags={false,false,false} },
  };
  if(i2s_channel_init_std_mode(i2sTx,&sc)!=ESP_OK){audioReady=false;return;}
  i2s_channel_enable(i2sTx);
  digitalWrite(PA_EN_PIN,HIGH);   // amp on
  audioReady=true;
  Serial.println("[AUDIO] ES8311 + I2S ready");
}
void audioTone(int freq,int ms,float vol){
  if(!audioReady)return;
  long total=(long)AUDIO_RATE*ms/1000; int16_t buf[256];
  float ph=0, inc=2.0f*PI*freq/AUDIO_RATE; long done=0;
  while(done<total){
    int n=(int)min((long)256,total-done);
    for(int i=0;i<n;i++){buf[i]=(int16_t)(sinf(ph)*32767.0f*vol); ph+=inc; if(ph>2*PI)ph-=2*PI;}
    size_t wr; i2s_channel_write(i2sTx,buf,n*sizeof(int16_t),&wr,100);
    done+=n;
  }
}
void audioGap(int ms){
  if(!audioReady)return;
  long total=(long)AUDIO_RATE*ms/1000; int16_t z[256]={0}; long done=0;
  while(done<total){int n=(int)min((long)256,total-done);size_t wr;i2s_channel_write(i2sTx,z,n*sizeof(int16_t),&wr,100);done+=n;}
}
void audioBoot(){ audioTone(880,120,0.5f); audioTone(1320,150,0.5f); }
// kind: 0 camera/tracker, 1 following, 2 approaching
void audioAlert(int kind){
  if(!audioReady)return;
  if(kind==1){ for(int i=0;i<3;i++){audioTone(1500,150,0.85f);audioGap(70);} }      // urgent triple
  else if(kind==2){ audioTone(1150,180,0.75f);audioGap(60);audioTone(1600,180,0.75f);} // rising couplet
  else { audioTone(1000,200,0.75f);audioGap(60);audioTone(1000,200,0.75f); }          // double beep
}

// ---- optional spoken voice (ESP8266SAM) reusing the same I2S channel ----
#if ENABLE_VOICE
#include "AudioOutput.h"     // from the ESP8266Audio library (dep of ESP8266SAM)
#include <ESP8266SAM.h>
// Sink that feeds SAM's samples straight into our ES8311 I2S channel.
class I2SSpeechSink : public AudioOutput {
 public:
  bool begin() override { return true; }
  bool ConsumeSample(int16_t sample[2]) override {
    if(!audioReady) return false;
    int16_t mono = sample[0];
    size_t wr; i2s_channel_write(i2sTx, &mono, sizeof(mono), &wr, 50);
    return true;
  }
  bool stop() override { return true; }
};
