prestonericson7-lang/Pred_Ai/esp32_surveillance_detector/surveillance_detector.ino
I2SSpeechSink* speechSink = nullptr;
#endif

// Speak the phrase if voice is enabled+ready; otherwise play the tone pattern.
void alertSound(int kind,const char* phrase){
#if ENABLE_VOICE
  if(audioReady && speechSink){ ESP8266SAM sam; sam.Say(speechSink, phrase); return; }
#else
  (void)phrase;
#endif
  audioAlert(kind);
}
#endif // ENABLE_AUDIO

// ---------------- TFT ----------------
#if ENABLE_TFT
bool isFollowing(const Sighting* s){return s->mobileFlag||s->approachFlag;}
void tftBanner(const char* t,uint16_t c){tft.fillRect(0,0,tft.width(),22,c);tft.setTextColor(ST77XX_BLACK,c);tft.setTextSize(2);tft.setCursor(4,4);tft.print(t);}
void drawScreen(){
  int fl=0; for(int i=0;i<deviceCount;i++) if(devices[i].vendorFlag||isFollowing(&devices[i]))fl++;
  tft.fillScreen(ST77XX_BLACK);
  char h[40]; snprintf(h,sizeof(h),"Pred_Ai  %d flagged",fl);
  tftBanner(h, fl?ST77XX_RED:ST77XX_GREEN);
  tft.setTextSize(1); int y=28;
  for(int i=0;i<deviceCount&&y<tft.height()-12;i++){
    Sighting* s=&devices[i]; bool f=isFollowing(s);
    if(!(s->vendorFlag||f))continue;
    tft.setTextColor(f?ST77XX_RED:ST77XX_YELLOW,ST77XX_BLACK);
    tft.setCursor(2,y); tft.printf("%-6s %-15s %ddB",f?"FOLLOW":"VENDOR",s->label,s->bestRssi); y+=11;
  }
  tft.setTextColor(ST77XX_WHITE,ST77XX_BLACK); tft.setCursor(2,tft.height()-10);
  tft.printf("seen:%d GPS:%s SD:%s",deviceCount,gpsFix?"Y":"N",sdReady?"Y":"N");
}
void tftAlertFlash(){tft.fillScreen(ST77XX_RED);delay(150);}
// Full-screen alert that spells out the threat.
void tftAlertScreen(const char* title,const Sighting* s){
  tft.fillScreen(ST77XX_RED);
  tft.setTextColor(ST77XX_WHITE,ST77XX_RED);
  tft.setTextSize(3); tft.setCursor(8,12);  tft.print("! ALERT");
  tft.setTextSize(2); tft.setCursor(8,56);  tft.print(title);
  tft.setTextSize(1);
  tft.setCursor(8,92);  tft.printf("%s   %d dB", s->label, s->bestRssi);
  tft.setCursor(8,108); tft.printf("%s  %s", s->isBle?"BLE":"WIFI", macToStr(s->mac).c_str());
  tft.setCursor(8,132); tft.print(getTimestamp());
  delay(1400);
}
#endif

// ---------------- alerts ----------------
void ledBlink(){
  if(ALERT_LED_PIN<0)return;
  for(int i=0;i<6;i++){digitalWrite(ALERT_LED_PIN,HIGH);delay(90);digitalWrite(ALERT_LED_PIN,LOW);delay(90);}
}
void raiseAlert(const Sighting* s,const char* reason){
  Serial.printf("*** ALERT: %s %s %s [%s] rssi=%d @ %.6f,%.6f %s\n",
    reason,s->isBle?"BLE":"WIFI",macToStr(s->mac).c_str(),s->label,s->bestRssi,curLat,curLon,getTimestamp().c_str());
  if(!alertsEnabled)return;
  int kind = s->mobileFlag?1 : (s->approachFlag?2:0);
  const char* title = s->mobileFlag    ? "FOLLOWING YOU"
                    : s->approachFlag  ? "APPROACHING YOU"
                                       : "CAMERA / TRACKER";
#if ENABLE_TFT
  tftAlertScreen(title,s);
#endif
#if ENABLE_AUDIO
  const char* phrase = s->mobileFlag   ? "Warning. A device is following you."
                     : s->approachFlag ? "Warning. A device is approaching."
                                       : "Camera or tracker detected.";
  alertSound(kind, phrase);
#endif
  ledBlink();
}

// ---------------- record + log ----------------
void logSighting(Sighting* s,int rssi){
  String flag="";
  if(s->vendorFlag)flag+="VENDOR ";
  if(s->mobileFlag)flag+="FOLLOWING ";
  if(s->approachFlag)flag+="APPROACHING ";
  if(flag=="")flag="-";
  String line=getTimestamp()+","+String(curLat,6)+","+String(curLon,6)+","+
    (s->isBle?"BLE":"WIFI")+","+macToStr(s->mac)+","+String(s->label)+","+
    String(rssi)+","+String(s->hits)+","+flag;
  Serial.println(line);
  if(sdReady){File f=SD.open(LOG_PATH,FILE_APPEND);if(f){f.println(line);f.close();}}
}

// find existing, else allocate (evicting the oldest non-flagged when full)
Sighting* getSlot(const uint8_t* mac,bool isBle){
  for(int i=0;i<deviceCount;i++)
    if(devices[i].isBle==isBle&&memcmp(devices[i].mac,mac,6)==0) return &devices[i];
  if(deviceCount<MAX_DEVICES) return &devices[deviceCount++];
  // table full: recycle the oldest device that isn't flagged
  int victim=-1; uint32_t oldest=0xFFFFFFFF;
  for(int i=0;i<deviceCount;i++){
    if(devices[i].vendorFlag||devices[i].mobileFlag||devices[i].approachFlag)continue;
    if(devices[i].lastSeenMs<oldest){oldest=devices[i].lastSeenMs;victim=i;}
  }
  return (victim>=0)?&devices[victim]:nullptr;  // all flagged => drop new
}

// risk: 0 none, 1 info/IoT, 2 camera-grade
void recordDevice(const uint8_t* mac,bool isBle,int rssi,const char* label,int risk){
  uint32_t now=millis();
  Sighting* s=getSlot(mac,isBle);
  if(!s)return;
  bool isNew = !(s->isBle==isBle && memcmp(s->mac,mac,6)==0 && s->hits>0);
  if(isNew){
    memset(s,0,sizeof(*s));
    memcpy(s->mac,mac,6); s->isBle=isBle;
    s->firstRssi=rssi; s->bestRssi=rssi; s->emaRssi=rssi;
    s->firstSeenMs=now; s->firstLat=curLat; s->firstLon=curLon;
    s->lastCycle=scanCycle-1;
    strncpy(s->label,label,sizeof(s->label)-1);
  }
  s->hits++;
  s->lastSeenMs=now; s->lastLat=curLat; s->lastLon=curLon;
  if(rssi>s->bestRssi)s->bestRssi=rssi;
  s->emaRssi += EMA_ALPHA*(rssi - s->emaRssi);
  if(s->lastCycle!=scanCycle){s->cycles++;s->lastCycle=scanCycle;}
  if(risk>=1){s->vendorFlag=true; if(label[0])strncpy(s->label,label,sizeof(s->label)-1);}

  // FOLLOWING (GPS): moved with you, sustained over cycles + time
  if(gpsFix && s->cycles>=APPROACH_MIN_CYC && (now-s->firstSeenMs)>=APPROACH_MIN_MS &&
     haversineMeters(s->firstLat,s->firstLon,curLat,curLon)>MOVE_METERS)
    s->mobileFlag=true;

  // APPROACHING (no GPS): smoothed signal climbed, sustained over cycles + time
  if(s->cycles>=APPROACH_MIN_CYC && (now-s->firstSeenMs)>=APPROACH_MIN_MS &&
     (s->emaRssi - s->firstRssi)>=APPROACH_DB)
    s->approachFlag=true;

  bool following=s->mobileFlag||s->approachFlag;
  s->alertWorthy = (risk>=2) || following;
  logSighting(s,rssi);
  if(s->alertWorthy && !s->alerted){
    raiseAlert(s, following ? (s->mobileFlag?"FOLLOWING (moved with you)":"APPROACHING (signal rising)")
                            : "camera-grade device");
    s->alerted=true;
  }
}

// ---------------- scans ----------------
void scanWifi(){
  int n=WiFi.scanNetworks(false,true);
  for(int i=0;i<n;i++){
    uint8_t* b=WiFi.BSSID(i); if(!b)continue;
    char label[24]; int risk=0;
    int oui=lookupOui(b);
    String ssid=WiFi.SSID(i); String low=ssid; low.toLowerCase();
    int kw=matchKeyword(low,SSID_KEYWORDS,SSID_KW_COUNT);
    if(kw>=0){ risk=2; snprintf(label,sizeof(label),"cam:%s",SSID_KEYWORDS[kw]); }
    else if(oui>=0){ risk=OUI_TABLE[oui].risk; strncpy(label,OUI_TABLE[oui].name,sizeof(label)-1); label[sizeof(label)-1]='\0'; }
    else if(ssid.length()>0){ snprintf(label,sizeof(label),"wifi:%s",ssid.c_str()); }
    else { strcpy(label,"wifi:<hidden>"); }
    recordDevice(b,false,WiFi.RSSI(i),label,risk);
  }
  WiFi.scanDelete();
}
void performPassiveScan(){   // original name kept; real BLE detection
  BLEScanResults* r=pBLEScan->start(BLE_SCAN_SECS,false);
  int n=r->getCount();
  for(int i=0;i<n;i++){
    BLEAdvertisedDevice d=r->getDevice(i);
    BLEAddress addr=d.getAddress();            // keep alive (getNative() points into it)
    uint8_t native[6]; memcpy(native,addr.getNative(),6);
    char label[24]="ble"; int risk=0;
    if(d.haveManufacturerData()){
      String md=d.getManufacturerData();
      if(md.length()>=2){
        uint16_t co=(uint8_t)md[0]|((uint8_t)md[1]<<8);
        if(co==0x004C){
          if(md.length()>=4&&(uint8_t)md[2]==0x12){strncpy(label,"AirTag/FindMy?",23);risk=2;}
          else strncpy(label,"Apple BLE",23);
        } else if(co==0x0075) strncpy(label,"Samsung BLE",23);
        label[23]='\0';
      }
    }
    if(d.haveServiceUUID()){
      String u=d.getServiceUUID().toString().c_str();
      if(u.indexOf("feed")>=0||u.indexOf("feec")>=0){strcpy(label,"Tile tracker");risk=2;}
      else if(u.indexOf("fd5a")>=0){strcpy(label,"Samsung SmartTag");risk=2;}
    }
    if(d.haveName()&&d.getName().length()>0){
      String nm=d.getName().c_str(); String low=nm; low.toLowerCase();
      int kw=matchKeyword(low,BLE_KEYWORDS,BLE_KW_COUNT);
      if(kw>=0){snprintf(label,sizeof(label),"trk:%s",BLE_KEYWORDS[kw]);risk=2;}
      else if(risk==0)snprintf(label,sizeof(label),"ble:%s",nm.c_str());
    }
    recordDevice(native,true,d.getRSSI(),label,risk);
  }
  pBLEScan->clearResults();
}

// ---------------- serial commands ----------------
void printDevice(const Sighting* s){
  bool f=s->vendorFlag||s->mobileFlag||s->approachFlag;
  Serial.printf("  %s %s rssi=%d ema=%.0f hits=%u cyc=%u %s%s%s%s [%s]\n",
    s->isBle?"BLE ":"WIFI",macToStr(s->mac).c_str(),s->bestRssi,s->emaRssi,s->hits,s->cycles,
    s->vendorFlag?"VENDOR ":"",s->mobileFlag?"FOLLOWING ":"",s->approachFlag?"APPROACHING ":"",f?"":"-",s->label);
}
bool handleReview(String c){
  c.trim(); c.toLowerCase();
  if(c=="help"||c=="?"){Serial.println("list | flagged | gps | save | clear | testalert  (encrypted cmds also work)");return true;}
  if(c=="list"){Serial.printf("== %d devices ==\n",deviceCount);for(int i=0;i<deviceCount;i++)printDevice(&devices[i]);return true;}
  if(c=="flagged"){int n=0;for(int i=0;i<deviceCount;i++)if(devices[i].vendorFlag||devices[i].mobileFlag||devices[i].approachFlag){printDevice(&devices[i]);n++;}Serial.printf("(%d flagged)\n",n);return true;}
  if(c=="gps"){Serial.printf("GPS fix=%s lat=%.6f lon=%.6f sats=%d\n",gpsFix?"yes":"no",curLat,curLon,gps.satellites.isValid()?gps.satellites.value():0);return true;}
  if(c=="save"){saveTable();Serial.println("Saved.");return true;}
  if(c=="clear"){deviceCount=0;saveTable();Serial.println("Cleared.");return true;}
  if(c=="testalert"){
#if ENABLE_TFT
    tftAlertFlash();
#endif
#if ENABLE_AUDIO
    alertSound(0, "Test alert.");
#endif
    ledBlink();
    Serial.println("Test alert fired (screen + speaker + LED).");return true;}
  return false;
}
void executeCommand(String rawCmd){    // your XOR + history path (kept)
  String cmd=decryptCommand(rawCmd);
  cmd.trim(); String original=cmd; cmd.toLowerCase();
  if(isRepeatCommand(cmd)){Serial.println("Repeat command ignored for safety");return;}
  addToHistory(cmd);
  Serial.printf("Command: %s\n",original.c_str());
  if(cmd.indexOf("spam on")!=-1||cmd.indexOf("shield")!=-1||cmd.indexOf("crowd")!=-1||cmd.indexOf("activate")!=-1){
    activeMode=true; scanningEnabled=true; alertsEnabled=true;
    Serial.println("SHIELD/ACTIVE: detection+alerts ON (active transmit omitted in this build)");
  } else if(cmd.indexOf("scan on")!=-1||cmd.indexOf("passive")!=-1||cmd.indexOf("listen")!=-1){
    scanningEnabled=true; Serial.println("PASSIVE DETECTION ON");
  } else if(cmd.indexOf("off")!=-1||cmd.indexOf("stop")!=-1){
    scanningEnabled=false; activeMode=false; Serial.println("DETECTION PAUSED");
  } else if(cmd.indexOf("status")!=-1){
    logStatusToSD(); Serial.println("Status logged");
  } else Serial.println("Unknown - general order");
}
// non-blocking serial line reader (serialEvent() is unreliable on ESP32)
void pollSerial(){
  static String buf;
  while(Serial.available()){
    char ch=Serial.read();
    if(ch=='\n'){ String line=buf; buf=""; String p=line; p.trim();
      if(!handleReview(p)) executeCommand(line); }
    else if(ch!='\r') buf+=ch;
  }
}

// ---------------- setup / loop ----------------
void setup(){
  Serial.begin(115200); delay(200);
  randomSeed(esp_random());

  // version-safe task watchdog (kept; IDF5/Arduino-3.x changed the API)
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t wdtc = { 20000, 0, true };
  esp_task_wdt_reconfigure(&wdtc);   // TWDT already inited by Arduino on IDF5
  esp_task_wdt_add(NULL);            // subscribe loop task (ignore if already added)
#else
  esp_task_wdt_init(20, true);
  esp_task_wdt_add(NULL);
#endif

