prestonericson7-lang/Pred_Ai/esp32_surveillance_detector/surveillance_detector.ino
  if(ALERT_LED_PIN>=0){pinMode(ALERT_LED_PIN,OUTPUT);digitalWrite(ALERT_LED_PIN,LOW);}

#if ENABLE_TFT
  pinMode(TFT_BL,OUTPUT); digitalWrite(TFT_BL,HIGH);   // backlight on
  SPI.begin(TFT_SCLK,-1,TFT_MOSI,TFT_CS);
  tft.init(240,320);            // ST7789 native 240x320
  tft.invertDisplay(true);      // LAFVIN panel uses inverted colour
  tft.setRotation(3);           // landscape (flip to 1 if upside-down)
  tft.fillScreen(ST77XX_BLACK);
  tftBanner("Pred_Ai booting...",ST77XX_GREEN);
#endif

  sdReady=SD.begin(SD_CS_PIN);
  if(sdReady){
    Serial.println("SD OK");
    logFile=SD.open("/guardian.log",FILE_APPEND);
    if(logFile){logFile.println("=== Log Started ===");logFile.close();}
    File f=SD.open(LOG_PATH,FILE_APPEND);
    if(f){if(f.size()==0)f.println("timestamp,lat,lon,type,mac,label,rssi,hits,flags");f.close();}
    loadTable();
  } else Serial.println("SD: not found (serial/TFT only)");

  gpsSerial.begin(GPS_BAUD,SERIAL_8N1,GPS_RX_PIN,GPS_TX_PIN);

  WiFi.mode(WIFI_STA); WiFi.disconnect();   // station = listen only
  BLEDevice::init("");
  pBLEScan=BLEDevice::getScan();
  pBLEScan->setActiveScan(true);
  pBLEScan->setInterval(100); pBLEScan->setWindow(99);

#if ENABLE_AUDIO
  audioInit();
#if ENABLE_VOICE
  if(audioReady) speechSink = new I2SSpeechSink();
#endif
  if(audioReady) audioBoot();    // startup chime confirms the speaker works
#endif

  Serial.println("Guardian Detector ready. Type 'help'.");
}

void loop(){
  esp_task_wdt_reset();
  pollSerial();
  while(gpsSerial.available()>0)gps.encode(gpsSerial.read());
  if(gps.location.isUpdated()&&gps.location.isValid()){
    realLat=gps.location.lat(); realLon=gps.location.lng();
    curLat=realLat; curLon=realLon; gpsFix=true;
  }
  unsigned long now=millis();
  if(scanningEnabled && now-lastScan>SCAN_PERIOD){
    lastScan=now; scanCycle++;
    scanWifi(); performPassiveScan(); saveTable();
#if ENABLE_TFT
    drawScreen();
#endif
  }
  if(now-lastLogTime>8000){logStatusToSD();lastLogTime=now;}
  delay(5);
}
